## 转载自知乎

作者：匿名用户
链接：https://www.zhihu.com/question/471407550/answer/1991651424
来源：知乎

回答被删了就挺奇怪的，于是在此梳理一下时间线吧。也算是提醒一下后来的计科同学，能够分散实习就分散实习。5月7日，首次开始阐述集中实习的相关时间安排：7月5日至7月25日，早上8:30—11:30，14:00—17:00，19:00—21:00。一周工作六天。具体如何安排这些时间并没有说得太详细，而此时具体实际开始集中实习还有两个月的时间，因此没有掀起太大的波澜，最后以统一发通知而结束讨论。

![image](https://user-images.githubusercontent.com/87229579/125189869-d9999b00-e26c-11eb-9967-0b3b92d703b5.png)


6月15日。悬而未决许久的统一通知下发到群中，而很明显的是，两份通知的落款是往年的表格，而非21年刚定下来的。其中一份是认识与实习工作的通知，落款是2017年5月22日

![image](https://user-images.githubusercontent.com/87229579/125189895-fb931d80-e26c-11eb-900f-890f3bfbe0e2.png)

另外一份是分散实习的表格，落款是2013年6月28日

![image](https://user-images.githubusercontent.com/87229579/125189902-06e64900-e26d-11eb-8c4d-c85dd887fd09.png)


分散实习最晚六月底提交，此时只剩下不到半个月时间。除非是早已联系好公司进行实习同学，其他刚收到这个通知的同学并没有选择的权利，几乎已经确定是不得不参与集中实习。6月18日，动员大会。正式进行通知。

![image](https://user-images.githubusercontent.com/87229579/125189905-11084780-e26d-11eb-9c95-34b9800d403c.png)


但是与此同时，只有计算机科学与技术专业的同学是这样的福报安排，隔壁物联和信安的晚上均不需要参与实习，并且每周也只工作五天。7月7日对于一天在那个教室从早八到晚九的安排，学生提出了不满。主要的矛盾点在于，晚上的七点到九点是完全没有必要的，是强迫同学在教室自习，而这个自习还必须上下班打卡。可是为什么需要这样的强制自习？对于计科和物联信安有如此大的差别的原因，老师方面则搪塞处理。

![image](https://user-images.githubusercontent.com/87229579/125189913-1a91af80-e26d-11eb-9503-827ccf1df327.png)


以“每个实习队有每个实习队的规矩”为由，并没有解决矛盾核心。7月10日周六，没有安排，全天自习，需要上下班打卡。

![image](https://user-images.githubusercontent.com/87229579/125189939-3f862280-e26d-11eb-95a6-eb714b5f8824.png)


对此的回答与之前如出一撤。

![image](https://user-images.githubusercontent.com/87229579/125189943-47de5d80-e26d-11eb-9c9b-20e2035439dc.png)


同时在多次询问无果之后，以一位暴躁同学开骂退群结束后，老师给出了如下的答复。

![image](https://user-images.githubusercontent.com/87229579/125189953-5167c580-e26d-11eb-9639-a212fd1fa933.png)


而6月30日的时候他给出的答复如下。

![image](https://user-images.githubusercontent.com/87229579/125189958-588ed380-e26d-11eb-8ef9-cd8128a3a5e3.png)


鉴于群中开始涌入非计科同学看热闹，因此老师作出了重建群的决定。

![image](https://user-images.githubusercontent.com/87229579/125189965-60e70e80-e26d-11eb-83b5-0d78428f8835.png)
